
# Kural Tabanlı Sınıflandırma ile Potansiyel Müşteri Getirisi Hesaplama
# İş Problemi:

### Bir oyun şirketi müşterilerinin bazı özelliklerini kullanarak seviye tabanlı (level based) yeni müşteri tanımları (persona) oluşturmak ve bu yeni müşteri tanımlarına göre segmentler oluşturup bu segmentlere göre yeni gelebilecek müşterilerin şirkete ortalama ne kadar kazandırabileceğini tahmin etmek istemektedir.

### Örneğin: Türkiye’den IOS kullanıcısı olan 25 yaşındaki bir erkek kullanıcının ortalama ne kadar kazandırabileceği belirlenmek isteniyor.

## Veri Seti Hikayesi
### Persona.csv veri seti uluslararası bir oyun şirketinin sattığı ürünlerin fiyatlarını ve bu ürünleri satın alan kullanıcıların bazı demografik bilgilerini barındırmaktadır. Veri seti her satış işleminde oluşan kayıtlardan meydana gelmektedir. Bunun anlamı tablo  tekilleştirilmemiştir. Diğer bir ifade ile belirli demografik özelliklere sahip bir kullanıcı birden fazla alışveriş yapmış olabilir.

### Price: Müşterinin harcama tutarı
### Source: Müşterinin bağlandığı cihaz türü
### Sex: Müşterinin cinsiyeti
### Country: Müşterinin ülkesi
### Age: Müşterinin yaşı

# Gorev 1: 
## Soru 1: persone.csv dosyasını okutunuz ve veri seti ile ilgili genel bilgileri elde ediniz.

In [3]:
import pandas as pd
df = pd.read_csv("C:/Users/ibrah/Desktop/PYTHON/proje/persona.csv")
print("#### HEAD #####")
print(df.head())
print("\n#### SHAPE #####")
print(df.shape)
print("\n#### INFO ####")
print(df.info())

#### HEAD #####
   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

#### SHAPE #####
(5000, 5)

#### INFO ####
<class 'pandas.core.frame.DataFrame'>
Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB
None

## Soru 2: Kac  unique SOURCE vardır? Frekansları nelerdir?

In [12]:
print(f"SOURCE degiskeninin {df['SOURCE'].nunique()} adet sınıfı vardır")
print(f"\nSOURCE degiskeninin frekansları asagıdadır:\n {df['SOURCE'].value_counts()}")

SOURCE degiskeninin 2 adet sınıfı vardır

SOURCE degiskeninin frekansları asagıdadır:
 SOURCE
android    2974
ios        2026
Name: count, dtype: int64

## SORU 3: Kac unique PRICE vardır?

In [16]:
print(f"PRICE degiskeni unique:\n {df['PRICE'].nunique()} \n adettir.")

PRICE degiskeni unique:
 6
 adettir.

## SORU 4: Hangi PRICE'dan kacar tane satıss gerceklesmistir?

In [17]:
print(f"PRICE'lardan gerceklesen satıs adetleri:\n {df['PRICE'].value_counts()}")

PRICE'lardan gerceklesen satıs adetleri:
 PRICE
29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: count, dtype: int64

## SORU 5: Hangi ulkeden kacar tane satıs gercekelsmıstır?

In [21]:
print(f"Ulkelerden gerceklesen satıs adetleri:\n {df['COUNTRY'].value_counts()}")

Ulkelerden gerceklesen satıs adetleri:
 COUNTRY
usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: count, dtype: int64

In [24]:
print("GROUPBY ILE:")
df.groupby("COUNTRY")["PRICE"].count()

GROUPBY ILE:

COUNTRY
bra    1496
can     230
deu     455
fra     303
tur     451
usa    2065
Name: PRICE, dtype: int64

In [25]:
print("PIVOT_TABLE ILE:")
df.pivot_table(values="PRICE", index="COUNTRY", aggfunc="count")

PIVOT_TABLE ILE:

         PRICE
COUNTRY
bra       1496
can        230
deu        455
fra        303
tur        451
usa       2065

## Soru 6: Ulkelere gore satıslardan toplam ne kadar kazanılmıs?

In [30]:
print("YOL 1:")
df.groupby("COUNTRY")["PRICE"].sum()

YOL 1:

COUNTRY
bra    51354
can     7730
deu    15485
fra    10177
tur    15689
usa    70225
Name: PRICE, dtype: int64

In [31]:
print("YOL 2:")
df.groupby("COUNTRY").agg({"PRICE": "sum"})

YOL 2:

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [32]:
print("YOL 3:")
df.pivot_table(values="PRICE", index="COUNTRY", aggfunc="sum")

YOL 3:

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

## Soru 7: SOURCE turlerıne gore satıs sayıları nedir?

In [33]:
df.groupby("SOURCE")["PRICE"].count()

SOURCE
android    2974
ios        2026
Name: PRICE, dtype: int64

In [35]:
df["SOURCE"].value_counts()

SOURCE
android    2974
ios        2026
Name: count, dtype: int64

## Soru 8: Ulkelere gore PRICE ortalamaları?

In [38]:
print("YOL 1:")
df.groupby("COUNTRY")["PRICE"].mean()

YOL 1:

COUNTRY
bra    34.327540
can    33.608696
deu    34.032967
fra    33.587459
tur    34.787140
usa    34.007264
Name: PRICE, dtype: float64

In [39]:
print("YOL 2:")
df.groupby("COUNTRY").agg({"PRICE": "mean"})

YOL 2:

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

In [41]:
print("YOL 3:")
df.pivot_table(values="PRICE", index="COUNTRY", aggfunc="mean")

YOL 3:

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

## Soru 9: SOURCE'lara gore PRICE ortalamaları nedir?

In [42]:
print("YOL 1:")
df.groupby("SOURCE")["PRICE"].mean()

YOL 1:

SOURCE
android    34.174849
ios        34.069102
Name: PRICE, dtype: float64

In [43]:
print("YOL 2:")
df.groupby("SOURCE").agg({"PRICE": "mean"})

YOL 2:

             PRICE
SOURCE
android  34.174849
ios      34.069102

In [44]:
print("YOL 3:")
df.pivot_table(values="PRICE", index="SOURCE", aggfunc="mean")

YOL 3:

             PRICE
SOURCE
android  34.174849
ios      34.069102

## Soru 10: COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?

In [46]:
df.groupby(by=["COUNTRY", 'SOURCE']).agg({"PRICE": "mean"})

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

# GOREV 2: 
## COUNTRY, SOURCE, SEX, AGE kırılımında ortalama kazanclar nedir?

In [50]:
df.groupby(by=["COUNTRY", "SOURCE", "SEX", "AGE"]).agg({"PRICE": "mean"}).head(50)

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
                       20   31.000000
                       21   37.292683
                       22   34.945946
                       23   31.941176
                       24   36.500000
                       25   35.666667
                       26   33.166667
                       27   26.142857
                       28   22.333333
                       29   37.571429
                       30   45.666667
                       31   35.097561
                       32   39.000000
                       34   24.000000
                       37   33.736842
                       38   34.555556
                       39   43.000000
                       41   32.333333
                       43   44.000000
                       45   33.615385
                       56   37.000000
                male   15   39.344828
                       16   29.666667
                       17   37.157895
                       18   33.054054
                       19   35.216216
                       20   35.400000
                       21   35.250000
                       22   31.000000
                       23   21.500000
                       24   40.428571
                       25   30.428571
                       26   37.095238
                       27   32.636364
                       28   28.230769
                       29   29.714286
                       30   35.363636
                       35   31.500000
                       36   31.857143
                       40   39.625000
                       41   35.666667
                       44   36.500000
                       46   59.000000
                       53   29.000000
        ios     female 15   36.777778

# GOREV 3:
## Cıktıyı PRICE'a gore sıralayınız.
### Oncekı sorudakı cıktıyı daha ıyı gorebılmek ıcın sort_values metodunu azalan olacak sekılde sıralayınız. Cıktıyı agg_df olarak kaydet.

In [51]:
agg_df = df.groupby(by=["COUNTRY", "SOURCE", "SEX", "AGE"]).agg({"PRICE": "mean"}).sort_values("PRICE", ascending=False)
agg_df.head(20)

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46   59.000000
usa     android male   36   59.000000
fra     android female 24   59.000000
usa     ios     male   32   54.000000
deu     android female 36   49.000000
                       51   49.000000
        ios     male   20   49.000000
usa     android female 47   49.000000
fra     ios     male   20   49.000000
usa     ios     male   59   46.500000
deu     android male   15   46.500000
bra     android female 30   45.666667
usa     android female 61   45.666667
tur     ios     male   24   45.000000
deu     android male   34   45.000000
tur     ios     female 18   44.000000
bra     android female 43   44.000000
        ios     female 22   44.000000
tur     android female 32   43.000000
bra     android female 39   43.000000

# GOREV 4: Indekste yer alan isimleri degisken ismine ceviriniz.
### Ucuncu sorunun cıktısında yer alan PRICE dısındakı tum degiskenler isimleridir.
### ipucu: reset_index()
### agg_df.reset_index(inplace=True)

In [52]:
agg_df = agg_df.reset_index()
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

# GOREV 5: AGE degiskenini kategorik degiskene ceveiriniz ve agg_df'e ekleyiniz.
#### Age sayısal değişkenini kategorik değişkene çeviriniz.
#### Aralıkları ikna edici olacağını düşündüğünüz şekilde oluşturunuz.
#### Örneğin: '0_18', '19_23', '24_30', '31_40', '41_70'

In [53]:
# AGE degiskeni sınıf aralıgı
bins = [0, 18, 23, 30, 40, df["AGE"].max()]

In [54]:
# Sınıf aralıklarına denk gelen tanımlamalar:
labels = ['0_18', '19-23', '24_30', '31_40', '41_' + str(agg_df["AGE"].max())]
labels

['0_18', '19-23', '24_30', '31_40', '41_66']

In [55]:
agg_df["age_categorical"] = pd.cut(agg_df["AGE"], bins, labels=labels)
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE age_categorical
0     bra  android    male   46   59.0           41_66
1     usa  android    male   36   59.0           31_40
2     fra  android  female   24   59.0           24_30
3     usa      ios    male   32   54.0           31_40
4     deu  android  female   36   49.0           31_40

# GOREV 6: 
## Yeni level based musterileri tanımlayınız ve veri setine degisken olarak ekleyiniz.
### customers_level_based adında degisken olsun.
### ListComprehensions ile customers_level_based degerleri olusturulduktan sonra bu degerlerin tekıllesitirilmesi gerekmektedir. Ornegin birden fazla su ıfadeden olabilir: "USA_ANDROID_MALE_0_18". Bunların groupby'a alıp PRICE ortalamlarını almak gerekmektedir.

In [68]:
print("YOL 1:")
agg_df["customers_level_based"] = agg_df[['COUNTRY', 'SOURCE', 'SEX', 'age_categorical']].agg(lambda
                                 x: '_'.join(x).upper(), axis=1)
agg_df.head()

YOL 1:

,COUNTRY,SOURCE,SEX,AGE,PRICE,age_categorical,customers_level_based
0,bra,android,male,46,59.0,41_66,BRA_ANDROID_MALE_41_66
1,usa,android,male,36,59.0,31_40,USA_ANDROID_MALE_31_40
2,fra,android,female,24,59.0,24_30,FRA_ANDROID_FEMALE_24_30
3,usa,ios,male,32,54.0,31_40,USA_IOS_MALE_31_40
4,deu,android,female,36,49.0,31_40,DEU_ANDROID_FEMALE_31_40

In [60]:
# print("YOL 2:")
#agg_df["customers_level_based"] = ['_'.join(i).upper() 
#                                   for i in agg_df.drop(["AGE", "PRICE"], axis=1).values]

YOL 2:

In [67]:
# agg_df.drop(columns=["customers_level_based"], inplace=True)
# agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE age_categorical
0     bra  android    male   46   59.0           41_66
1     usa  android    male   36   59.0           31_40
2     fra  android  female   24   59.0           24_30
3     usa      ios    male   32   54.0           31_40
4     deu  android  female   36   49.0           31_40

In [69]:
agg_df.head()

,COUNTRY,SOURCE,SEX,AGE,PRICE,age_categorical,customers_level_based
0,bra,android,male,46,59.0,41_66,BRA_ANDROID_MALE_41_66
1,usa,android,male,36,59.0,31_40,USA_ANDROID_MALE_31_40
2,fra,android,female,24,59.0,24_30,FRA_ANDROID_FEMALE_24_30
3,usa,ios,male,32,54.0,31_40,USA_IOS_MALE_31_40
4,deu,android,female,36,49.0,31_40,DEU_ANDROID_FEMALE_31_40

In [70]:
agg_df["customers_level_based"].value_counts()

customers_level_based
BRA_ANDROID_MALE_24_30      7
USA_ANDROID_MALE_41_66      7
USA_IOS_FEMALE_24_30        7
BRA_ANDROID_FEMALE_24_30    7
USA_ANDROID_MALE_24_30      7
                           ..
TUR_ANDROID_MALE_41_66      1
CAN_ANDROID_MALE_19-23      1
TUR_IOS_MALE_31_40          1
TUR_IOS_MALE_24_30          1
CAN_ANDROID_FEMALE_24_30    1
Name: count, Length: 109, dtype: int64

In [71]:
agg_df = agg_df.groupby("customers_level_based").agg({"PRICE": "mean"})

In [72]:
agg_df

                              PRICE
customers_level_based
BRA_ANDROID_FEMALE_0_18   35.645303
BRA_ANDROID_FEMALE_19-23  34.077340
BRA_ANDROID_FEMALE_24_30  33.863946
BRA_ANDROID_FEMALE_31_40  34.898326
BRA_ANDROID_FEMALE_41_66  36.737179
...                             ...
USA_IOS_MALE_0_18         33.983495
USA_IOS_MALE_19-23        34.901872
USA_IOS_MALE_24_30        34.838143
USA_IOS_MALE_31_40        36.206324
USA_IOS_MALE_41_66        35.750000

[109 rows x 1 columns]

In [75]:
agg_df = agg_df.reset_index()
agg_df.head()

      customers_level_based      PRICE
0   BRA_ANDROID_FEMALE_0_18  35.645303
1  BRA_ANDROID_FEMALE_19-23  34.077340
2  BRA_ANDROID_FEMALE_24_30  33.863946
3  BRA_ANDROID_FEMALE_31_40  34.898326
4  BRA_ANDROID_FEMALE_41_66  36.737179

In [76]:
agg_df["customers_level_based"].value_counts()

customers_level_based
BRA_ANDROID_FEMALE_0_18    1
TUR_ANDROID_FEMALE_0_18    1
TUR_IOS_FEMALE_19-23       1
TUR_IOS_FEMALE_0_18        1
TUR_ANDROID_MALE_41_66     1
                          ..
CAN_IOS_MALE_41_66         1
CAN_IOS_MALE_31_40         1
CAN_IOS_MALE_24_30         1
CAN_IOS_MALE_0_18          1
USA_IOS_MALE_41_66         1
Name: count, Length: 109, dtype: int64

In [77]:
agg_df.head()

      customers_level_based      PRICE
0   BRA_ANDROID_FEMALE_0_18  35.645303
1  BRA_ANDROID_FEMALE_19-23  34.077340
2  BRA_ANDROID_FEMALE_24_30  33.863946
3  BRA_ANDROID_FEMALE_31_40  34.898326
4  BRA_ANDROID_FEMALE_41_66  36.737179

# GOREV 7: Yenı musterılerı segmentlere ayırınız.
### PRICE'a gore segmentlere ayırınız. 
### Segmentleri "SEGMENT" isimlendirmesi ile agg_df'e ekleyiniz.
### segmetnleri betimleyiniz

In [79]:
agg_df["SEGMENT"] = pd.qcut(agg_df["PRICE"], 4 , labels=["D", "C", "B", "A"])
agg_df.head(30)

       customers_level_based      PRICE SEGMENT
0    BRA_ANDROID_FEMALE_0_18  35.645303       B
1   BRA_ANDROID_FEMALE_19-23  34.077340       C
2   BRA_ANDROID_FEMALE_24_30  33.863946       C
3   BRA_ANDROID_FEMALE_31_40  34.898326       B
4   BRA_ANDROID_FEMALE_41_66  36.737179       A
5      BRA_ANDROID_MALE_0_18  34.805861       B
6     BRA_ANDROID_MALE_19-23  31.673243       D
7     BRA_ANDROID_MALE_24_30  33.413919       C
8     BRA_ANDROID_MALE_31_40  34.327381       B
9     BRA_ANDROID_MALE_41_66  40.041667       A
10       BRA_IOS_FEMALE_0_18  34.900410       B
11      BRA_IOS_FEMALE_19-23  36.403846       A
12      BRA_IOS_FEMALE_24_30  34.015873       C
13      BRA_IOS_FEMALE_31_40  29.875902       D
14      BRA_IOS_FEMALE_41_66  35.340909       B
15         BRA_IOS_MALE_0_18  34.664559       B
16        BRA_IOS_MALE_19-23  34.266043       B
17        BRA_IOS_MALE_24_30  33.864865       C
18        BRA_IOS_MALE_31_40  31.566138       D
19        BRA_IOS_MALE_41_66  31.083694       D
20   CAN_ANDROID_FEMALE_0_18  30.896552       D
21  CAN_ANDROID_FEMALE_19-23  32.014706       D
22  CAN_ANDROID_FEMALE_24_30  19.000000       D
23  CAN_ANDROID_FEMALE_41_66  34.000000       C
24     CAN_ANDROID_MALE_0_18  36.000000       B
25    CAN_ANDROID_MALE_19-23  40.111111       A
26    CAN_ANDROID_MALE_24_30  35.009615       B
27    CAN_ANDROID_MALE_41_66  37.571429       A
28       CAN_IOS_FEMALE_0_18  31.352941       D
29      CAN_IOS_FEMALE_24_30  31.727273       D

In [80]:
agg_df.groupby("SEGMENT")["PRICE"].mean()

SEGMENT
D    29.206780
C    33.509674
B    34.999645
A    38.691234
Name: PRICE, dtype: float64

# GOREV 8: Yeni gelen musterileri sınfılandırınız. Ne kadar gelir getirebileceiğini tahmin ediniz.
### 33 Yasında ANDROID kullanan bir Turk Kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir

In [85]:
new_user = "TUR_ANDROID_FEMALE_31_40"

In [86]:
agg_df[agg_df["customers_level_based"] == new_user]

       customers_level_based      PRICE SEGMENT
72  TUR_ANDROID_FEMALE_31_40  41.833333       A

###  35 yaşında IOS kullanan bir Fransız kadını hangi segmente ve ortalama ne kadar gelir kazandırması beklenir?

In [87]:
new_user_2 = "FRA_IOS_FEMALE_31_40"

In [88]:
agg_df[agg_df["customers_level_based"] == new_user_2]

   customers_level_based      PRICE SEGMENT
63  FRA_IOS_FEMALE_31_40  32.818182       C